arendst/Tasmota/tasmota/tasmota_support/support_esp32.ino
/*
  support_esp32.ino - ESP32 specific support for Tasmota

  SPDX-FileCopyrightText: 2023 Theo Arends

  SPDX-License-Identifier: GPL-3.0-only
*/

#ifdef ESP32
/*********************************************************************************************\
 * ESP32, ESP32-C2, ESP32-C3, ESP32-C5, ESP32-C6, ESP32-H2, ESP32-P4, ESP32-S2 and ESP32-S3 Support
\*********************************************************************************************/

//                                                   11b 11g 11a 11n  11n  11ax 11ac
const static char kWifiPhyMode[] PROGMEM = "low rate|11b|11g|11a|HT20|HT40|HE20|VHT20"; // Wi-Fi Modes

#include "soc/soc.h"
#include "soc/spi_reg.h"
// See libraries\ESP32\examples\ResetReason.ino
#include "esp_chip_info.h"
#include <nvs.h>

#include "Esp.h"
#include "spi_flash_mmap.h"
#include <memory>
#include <soc/soc.h>
#include <soc/efuse_reg.h>
#include <esp_partition.h>
extern "C" {
#include "esp_ota_ops.h"
#include "esp_image_format.h"
}
#include "esp_system.h"
#include "esp_flash.h"

#include "bootloader_common.h"

// Flash memory mapping - See Esp.cpp

#if CONFIG_IDF_TARGET_ESP32               // ESP32/PICO-D4
  #include "esp32/rom/rtc.h"
  #include "esp32/rom/spi_flash.h"
  #define ESP_FLASH_IMAGE_BASE 0x1000     // Flash offset containing magic flash size and spi mode
#elif CONFIG_IDF_TARGET_ESP32S2
  #include "esp32s2/rom/rtc.h"
  #include "esp32s2/rom/spi_flash.h"
  #define ESP_FLASH_IMAGE_BASE 0x1000     // Flash offset containing magic flash size and spi mode
#elif CONFIG_IDF_TARGET_ESP32S3
  #include "esp32s3/rom/rtc.h"
  #include "esp32s3/rom/spi_flash.h"
  #define ESP_FLASH_IMAGE_BASE 0x0000     // Esp32s3 is located at 0x0000
#elif CONFIG_IDF_TARGET_ESP32C2
  #include "esp32c2/rom/rtc.h"
  #include "esp32c2/rom/spi_flash.h"
  #define ESP_FLASH_IMAGE_BASE 0x0000     // Esp32c2 is located at 0x0000
#elif CONFIG_IDF_TARGET_ESP32C3
  #include "esp32c3/rom/rtc.h"
  #include "esp32c3/rom/spi_flash.h"
  #define ESP_FLASH_IMAGE_BASE 0x0000     // Esp32c3 is located at 0x0000
#elif CONFIG_IDF_TARGET_ESP32C5
  #include "esp32c5/rom/rtc.h"
  #include "esp32c5/rom/spi_flash.h"
  #define ESP_FLASH_IMAGE_BASE 0x2000     // Esp32c5 is located at 0x2000
#elif CONFIG_IDF_TARGET_ESP32C6
  #include "esp32c6/rom/rtc.h"
  #include "esp32c6/rom/spi_flash.h"
  #define ESP_FLASH_IMAGE_BASE 0x0000     // Esp32c6 is located at 0x0000
#elif CONFIG_IDF_TARGET_ESP32H2
  #include "esp32h2/rom/rtc.h"
  #include "esp32h2/rom/spi_flash.h"
  #define ESP_FLASH_IMAGE_BASE 0x0000     // Esp32h2 is located at 0x0000
#elif CONFIG_IDF_TARGET_ESP32P4
  #include "esp32p4/rom/rtc.h"
  #include "esp32p4/rom/spi_flash.h"
  #define ESP_FLASH_IMAGE_BASE 0x2000     // Esp32p4 is located at 0x2000
#else
  #error Target CONFIG_IDF_TARGET is not supported
#endif

#ifndef CONFIG_IDF_TARGET_ESP32P4
#include <esp_phy_init.h>
#endif

// Set the Stacksize for Arduino core. Default is 8192, some builds may need a bigger one
size_t getArduinoLoopTaskStackSize(void) {
  return SET_ESP32_STACK_SIZE;
}

// Handle 20k of NVM

bool NvmExists(const char *sNvsName) {
  nvs_handle_t handle;
  if (nvs_open(sNvsName, NVS_READONLY, &handle) != ESP_OK) {
    return false;
  }
  nvs_close(handle);
  return true;
}

bool NvmLoad(const char *sNvsName, const char *sName, void *pSettings, unsigned nSettingsLen) {
  nvs_handle_t handle;
  esp_err_t result = nvs_open(sNvsName, NVS_READONLY, &handle);
  if (result != ESP_OK) {
    AddLog(LOG_LEVEL_DEBUG, PSTR("NVS: Error %d"), result);
    return false;
  }
  size_t size = nSettingsLen;
  nvs_get_blob(handle, sName, pSettings, &size);
  nvs_close(handle);
  return true;
}

void NvmSave(const char *sNvsName, const char *sName, const void *pSettings, unsigned nSettingsLen) {
#ifdef USE_WEBCAM
  WcInterrupt(0);  // Stop stream if active to fix TG1WDT_SYS_RESET
#endif
  nvs_handle_t handle;
  esp_err_t result = nvs_open(sNvsName, NVS_READWRITE, &handle);
  if (result != ESP_OK) {
    AddLog(LOG_LEVEL_DEBUG, PSTR("NVS: Error %d"), result);
  } else {
    nvs_set_blob(handle, sName, pSettings, nSettingsLen);
    nvs_commit(handle);
    nvs_close(handle);
  }
#ifdef USE_WEBCAM
  WcInterrupt(1);
#endif
}

int32_t NvmErase(const char *sNvsName) {
  nvs_handle_t handle;
  int32_t result = nvs_open(sNvsName, NVS_READWRITE, &handle);
  if (ESP_OK == result) { result = nvs_erase_all(handle); }
  if (ESP_OK == result) { result = nvs_commit(handle); }
  nvs_close(handle);
  return result;
}

void SettingsErase(uint8_t type) {
  // SDK and Tasmota data is held in default NVS partition
  // Tasmota data is held also in file /.settings on default filesystem
  // cal_data - SDK PHY calibration data as documented in esp_phy_init.h
  // qpc      - Tasmota Quick Power Cycle state
  // main     - Tasmota Settings data
  int32_t r1, r2, r3 = 0;
  switch (type) {
    case 0:               // Reset 2 = Erase all flash from program end to end of physical flash
    case 2:               // Reset 5, 6 = Erase all flash from program end to end of physical flash excluding filesystem
//      nvs_flash_erase();  // Erase RTC, PHY, sta.mac, ap.sndchan, ap.mac, Tasmota etc.
      r1 = NvmErase("qpc");
      r2 = NvmErase("main");
#ifdef USE_UFILESYS
      r3 = TfsDeleteFile(TASM_FILE_SETTINGS);
#endif
      AddLog(LOG_LEVEL_DEBUG, PSTR(D_LOG_APPLICATION D_ERASE " Tasmota data (%d,%d,%d)"), r1, r2, r3);
      break;
    case 1:               // Reset 3 = SDK parameter area
    case 4:               // WIFI_FORCE_RF_CAL_ERASE = SDK parameter area
#ifdef SOC_SUPPORTS_WIFI
      r1 = esp_phy_erase_cal_data_in_nvs();
//      r1 = NvmErase("cal_data");
      AddLog(LOG_LEVEL_DEBUG, PSTR(D_LOG_APPLICATION D_ERASE " PHY data (%d)"), r1);
#endif //SOC_SUPPORTS_WIFI
      break;
    case 3:               // QPC Reached = QPC, Tasmota and SDK parameter area (0x0F3xxx - 0x0FFFFF)
//      nvs_flash_erase();  // Erase RTC, PHY, sta.mac, ap.sndchan, ap.mac, Tasmota etc.
      r1 = NvmErase("qpc");
      r2 = NvmErase("main");
//      r3 = esp_phy_erase_cal_data_in_nvs();
//      r3 = NvmErase("cal_data");
//      AddLog(LOG_LEVEL_DEBUG, PSTR(D_LOG_APPLICATION D_ERASE " Tasmota (%d,%d) and PHY data (%d)"), r1, r2, r3);
#ifdef USE_UFILESYS
      r3 = TfsDeleteFile(TASM_FILE_SETTINGS);
#endif
      AddLog(LOG_LEVEL_DEBUG, PSTR(D_LOG_APPLICATION D_ERASE " Tasmota data (%d,%d,%d)"), r1, r2, r3);
      break;
  }
}

uint32_t SettingsRead(void *data, size_t size) {
#ifdef USE_UFILESYS
  if (TfsLoadFile(TASM_FILE_SETTINGS, (uint8_t*)data, size)) {
    return 2;
  }
#endif
  if (NvmLoad("main", "Settings", data, size)) {
    return 1;
  };
  return 0;
}

