arendst/Tasmota/tasmota/tasmota_support/support_esp32.ino
  return F("No meaning");                                                   // 0 and undefined
}

String ESP_getResetReason(void) {
  return ESP32GetResetReason(0);  // CPU 0
}

uint32_t ESP_ResetInfoReason(void) {
  RESET_REASON reason = rtc_get_reset_reason(0);
  if (1  == reason) { return REASON_DEFAULT_RST; }       // POWERON_RESET
  if ((3  == reason) || (12 == reason)) { return REASON_SOFT_RESTART; }  // SW_RESET / RTC_SW_SYS_RESET and SW_CPU_RESET / RTC_SW_CPU_RESET
  if (5  == reason) { return REASON_DEEP_SLEEP_AWAKE; }  // DEEPSLEEP_RESET
//  if (3  == reason) { return REASON_EXT_SYS_RST; }       // SW_RESET / RTC_SW_SYS_RESET
  return -1; //no "official error code", but should work with the current code base
}

uint32_t ESP_getChipId(void) {
  uint32_t id = 0;
  for (uint32_t i = 0; i < 17; i = i +8) {
    id |= ((ESP.getEfuseMac() >> (40 - i)) & 0xff) << i;
  }
  return id;
}

uint32_t ESP_getFlashChipMagicSize(void) {
    esp_image_header_t fhdr;
//    if(ESP.flashRead(ESP_FLASH_IMAGE_BASE, (uint32_t*)&fhdr.magic, sizeof(esp_image_header_t)) && fhdr.magic != ESP_IMAGE_HEADER_MAGIC) {
//      return 0;
//    }
    if (esp_flash_read(esp_flash_default_chip, (void*)&fhdr, ESP_FLASH_IMAGE_BASE, sizeof(esp_image_header_t)) && fhdr.magic != ESP_IMAGE_HEADER_MAGIC) {
      return 0;
    }
    return ESP_magicFlashChipSize(fhdr.spi_size);
}

uint32_t ESP_magicFlashChipSize(uint8_t spi_size) {
/*
    switch(spi_size & 0x0F) {
    case 0x0: // 8 MBit (1MB)
        return 1048576;
    case 0x1: // 16 MBit (2MB)
        return 2097152;
    case 0x2: // 32 MBit (4MB)
        return 4194304;
    case 0x3: // 64 MBit (8MB)
        return 8388608;
    case 0x4: // 128 MBit (16MB)
        return 16777216;
    case 0x5: // 256 MBit (32MB)
        return 33554432;
    default:  // fail so return (1KB)
        return 1024;
    }
*/
  // When spi_size is bigger than 11 will return 0 (0x100000000 = 0x00000000)
  return (uint32_t)0x100000 << (spi_size & 0x0F);  // 0 = 8 MBit (1MB), 5 = 256 MBit (32MB)
}

uint32_t ESP_getSketchSize(void) {
  static uint32_t sketchsize = 0;

  if (!sketchsize) {
    sketchsize = ESP.getSketchSize();  // This takes almost 2 seconds on an ESP32
  }
  return sketchsize;
}

uint32_t ESP_getFreeSketchSpace(void) {
  if (EspSingleOtaPartition()) {
    uint32_t size = EspRunningFactoryPartition();
    if (!size) {
      size = ESP.getFreeSketchSpace();
    }
    return size - ESP_getSketchSize();
  }
  return ESP.getFreeSketchSpace();
}

uint32_t ESP_getHeapSize(void) {
  return ESP.getHeapSize();
}

uint32_t ESP_getFreeHeap(void) {
  // ESP_getFreeHeap() returns also IRAM which we don't use
  return heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
}

uint32_t ESP_getFreeHeap1024(void) {
  return ESP_getFreeHeap() / 1024;
}
/*
float ESP_getFreeHeap1024(void) {
  return ((float)ESP_getFreeHeap()) / 1024;
}
*/

uint32_t ESP_getMaxAllocHeap(void) {
  // arduino returns IRAM but we want only DRAM
#ifdef USE_GT911 // GT911 IRQ crashes with heap_caps_get_largest_free_block
  return ESP_getFreeHeap();
#endif
  uint32_t free_block_size = heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
  if (free_block_size > 100) { free_block_size -= 100; }
  return free_block_size;
}

int32_t ESP_getHeapFragmentation(void) {
  int32_t free_maxmem = 100 - (int32_t)(ESP_getMaxAllocHeap() * 100 / ESP_getFreeHeap());
  if (free_maxmem < 0) { free_maxmem = 0; }
  return free_maxmem;
}

void ESP_Restart(void) {
  ESP.restart();
}

uint32_t FlashWriteStartSector(void) {
  // Needs to be on SPI_FLASH_MMU_PAGE_SIZE (= 0x10000) alignment for mmap usage
  uint32_t aligned_address = ((EspFlashBaseAddress() + (2 * SPI_FLASH_MMU_PAGE_SIZE)) / SPI_FLASH_MMU_PAGE_SIZE) * SPI_FLASH_MMU_PAGE_SIZE;
  return aligned_address / SPI_FLASH_SEC_SIZE;
}

uint32_t FlashWriteMaxSector(void) {
  // Needs to be on SPI_FLASH_MMU_PAGE_SIZE (= 0x10000) alignment for mmap usage
  uint32_t aligned_end_address = (EspFlashBaseEndAddress() / SPI_FLASH_MMU_PAGE_SIZE) * SPI_FLASH_MMU_PAGE_SIZE;
  return aligned_end_address / SPI_FLASH_SEC_SIZE;
}

uint8_t* FlashDirectAccess(void) {
  uint32_t address = FlashWriteStartSector() * SPI_FLASH_SEC_SIZE;
  uint8_t* data = EspFlashMmap(address);
/*
  uint8_t buf[32];
  memcpy(buf, data, sizeof(buf));
  AddLog(LOG_LEVEL_DEBUG, PSTR("DBG: Flash start address 0x%08X, Mmap address 0x%08X, Data %*_H"), address, data, sizeof(buf), (uint8_t*)&buf);
*/
  return data;
}

uint32_t ESP_getFlashChipSpeed(void) {
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 3, 2)
  return ESP.getFlashFrequencyMHz() * 1000000;
#else
  return ESP.getFlashChipSpeed();  // In Hz
#endif
}

uint32_t ESP_getPsramSize(void) {
  return ESP.getPsramSize();
}

uint32_t ESP_getFreePsram(void) {
  return ESP.getFreePsram();
}

uint32_t ESP_getMaxAllocPsram(void) {
  return ESP.getMaxAllocPsram();
}

extern "C" {
  // bool IRAM_ATTR __attribute__((pure)) esp_psram_is_initialized(void)
  bool esp_psram_is_initialized(void);
}

// this function is a replacement for `psramFound()`.
// `psramFound()` can return true even if no PSRAM is actually installed
// This new version also checks `esp_spiram_is_initialized` to know if the PSRAM is initialized
bool FoundPSRAM(void) {
#if CONFIG_IDF_TARGET_ESP32C2 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6 || DISABLE_PSRAMCHECK || CORE32SOLO1
  return psramFound();
#elif CONFIG_IDF_TARGET_ESP32P4
  return ESP.getPsramSize() > 0;
#else
  return psramFound() && esp_psram_is_initialized();
#endif
}

// new function to check whether PSRAM is present and supported (i.e. required pacthes are present)
bool UsePSRAM(void) {
  static bool can_use_psram = CanUsePSRAM();
  return FoundPSRAM() && can_use_psram;
}

/*
 * ESP32 v1 and v2 needs some special patches to use PSRAM.
 * Standard Tasmota 32 do not include those patches.
 * If using ESP32 v1, please add: `-mfix-esp32-psram-cache-issue -lc-psram-workaround -lm-psram-workaround`
 *
 * This function returns true if the chip supports PSRAM natively (v3) or if the
 * patches are present.
 */
bool CanUsePSRAM(void) {
  if (!FoundPSRAM()) return false;
#ifdef HAS_PSRAM_FIX
  return true;
#endif
#ifdef CONFIG_IDF_TARGET_ESP32
  esp_chip_info_t chip_info;
  esp_chip_info(&chip_info);
  uint32_t chip_revision = chip_info.revision;
  // idf5 efuse_hal_chip_revision(void)
  if (chip_revision < 100) { chip_revision *= 100; }  // Make <idf5 idf5
  if ((CHIP_ESP32 == chip_info.model) && (chip_revision < 300)) {
    return false;
  }
#endif // CONFIG_IDF_TARGET_ESP32
  return true;
}

void *special_malloc(uint32_t size) {
  if (UsePSRAM()) {
    return heap_caps_malloc(size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
  } else {
    return malloc(size);
  }
}
void *special_realloc(void *ptr, size_t size) {
  if (UsePSRAM()) {
    return heap_caps_realloc(ptr, size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
  } else {
    return realloc(ptr, size);
  }
}
void *special_calloc(size_t num, size_t size) {
  if (UsePSRAM()) {
    return heap_caps_calloc(num, size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
  } else {
    return calloc(num, size);
  }
}

// Variants for IRAM heap, which need all accesses to be 32 bits aligned
void *special_malloc32(uint32_t size) {
  return heap_caps_malloc(size, MALLOC_CAP_32BIT);
}

float CpuTemperature(void) {
  return (float)temperatureRead();  // In Celsius
}

