arendst/Tasmota/tasmota/tasmota_support/support_esp32.ino
/*
#ifdef __cplusplus
extern "C" {
#endif

uint8_t temprature_sens_read();

#ifdef __cplusplus
}
#endif

#ifdef CONFIG_IDF_TARGET_ESP32
uint8_t temprature_sens_read();

float CpuTemperature(void) {
  uint8_t t = temprature_sens_read();

  AddLog(LOG_LEVEL_DEBUG, PSTR("TMP: value %d"), t);

  return (t - 32) / 1.8;
}
#else
float CpuTemperature(void) {
  // Currently (20210801) repeated calls to temperatureRead() on ESP32C3 and ESP32S2 result in IDF error messages
  static float t = NAN;
  if (isnan(t)) {
    t = (float)temperatureRead();  // In Celsius
  }
  return t;
}
#endif
*/

/*
#if CONFIG_IDF_TARGET_ESP32S2
#include "esp32s2/esp_efuse.h"
#elif CONFIG_IDF_TARGET_ESP32S3
#include "esp32s3/esp_efuse.h"
#elif CONFIG_IDF_TARGET_ESP32C3
#include "esp32c3/esp_efuse.h"
#endif
*/

// #include "esp_chip_info.h"

String GetDeviceFeatures(void) {
  esp_chip_info_t chip_info;
  esp_chip_info(&chip_info);

  String chip_features = "[";
  bool first_feature = true;
  auto appendFeature = [&](const char *name) {
    if (!first_feature) {
      chip_features += ",";
    }
    first_feature = false;
    chip_features += "\"";
    chip_features += name;
    chip_features += "\"";
  };

  if (chip_info.features & CHIP_FEATURE_WIFI_BGN) {
    appendFeature("WIFI_BGN");
  }
  if (chip_info.features & CHIP_FEATURE_BLE) {
    appendFeature("BLE");
  }
  if (chip_info.features & CHIP_FEATURE_BT) {
    appendFeature("BT");
  }
  if (chip_info.features & CHIP_FEATURE_EMB_FLASH) {
    appendFeature("EMB_FLASH");
  }
  if (chip_info.features & CHIP_FEATURE_IEEE802154) {
    appendFeature("IEEE802154");
  }
  if (chip_info.features & CHIP_FEATURE_EMB_PSRAM) {
    appendFeature("EMB_PSRAM");
  }
  chip_features += "]";
  return chip_features;
}

String GetDeviceHardware(void) {
  // https://www.espressif.com/en/products/socs

/*
Source: esp-idf esp_system.h or arduino core esp_chip_info.h and esptool

typedef enum {
    CHIP_ESP32  = 1, //!< ESP32
    CHIP_ESP32S2 = 2, //!< ESP32-S2
    CHIP_ESP32S3 = 9, //!< ESP32-S3
    CHIP_ESP32C3 = 5, //!< ESP32-C3
    CHIP_ESP32C2 = 12, //!< ESP32-C2
    CHIP_ESP32C5 = 23, //!< ESP32-C5
    CHIP_ESP32C6 = 13, //!< ESP32-C6
    CHIP_ESP32H2 = 16, //!< ESP32-H2
    CHIP_POSIX_LINUX = 999, //!< The code is running on POSIX/Linux simulator
} esp_chip_model_t;

// Chip feature flags, used in esp_chip_info_t
#define CHIP_FEATURE_EMB_FLASH      BIT(0)      //!< Chip has embedded flash memory
#define CHIP_FEATURE_WIFI_BGN       BIT(1)      //!< Chip has 2.4GHz WiFi
#define CHIP_FEATURE_BLE            BIT(4)      //!< Chip has Bluetooth LE
#define CHIP_FEATURE_BT             BIT(5)      //!< Chip has Bluetooth Classic
#define CHIP_FEATURE_IEEE802154     BIT(6)      //!< Chip has IEEE 802.15.4
#define CHIP_FEATURE_EMB_PSRAM      BIT(7)      //!< Chip has embedded psram

// The structure represents information about the chip
typedef struct {
    esp_chip_model_t model;  //!< chip model, one of esp_chip_model_t
    uint32_t features;       //!< bit mask of CHIP_FEATURE_x feature flags
    uint16_t revision;       //!< chip revision number (in format MXX; where M - wafer major version, XX - wafer minor version)
    uint8_t cores;           //!< number of CPU cores
} esp_chip_info_t;

*/
  esp_chip_info_t chip_info;
  esp_chip_info(&chip_info);
  uint32_t chip_model = chip_info.model;
  uint32_t chip_revision = chip_info.revision;
//  uint32_t chip_revision = ESP.getChipRevision();
  // idf5 efuse_hal_chip_revision(void)
  if (chip_revision < 100) { chip_revision *= 100; }  // Make <idf5 idf5
  bool rev3 = (chip_revision >= 300);
//  bool single_core = (1 == ESP.getChipCores());
  bool single_core = (1 == chip_info.cores);
  uint32_t pkg_version = bootloader_common_get_chip_ver_pkg();

  switch (chip_model) {
    case 0:
    case 1: {  // ESP32
      /*
      ESP32 Series
      - 32-bit MCU & 2.4 GHz Wi-Fi & Bluetooth/Bluetooth LE
      - Two or one CPU core(s) with adjustable clock frequency, ranging from 80 MHz to 240 MHz
      - +19.5 dBm output power ensures a good physical range
      - Classic Bluetooth for legacy connections, also supporting L2CAP, SDP, GAP, SMP, AVDTP, AVCTP, A2DP (SNK) and AVRCP (CT)
      - Support for Bluetooth Low Energy (Bluetooth LE) profiles including L2CAP, GAP, GATT, SMP, and GATT-based profiles like BluFi, SPP-like, etc
      - Bluetooth Low Energy (Bluetooth LE) connects to smart phones, broadcasting low-energy beacons for easy detection
      - Sleep current is less than 5 μA, making it suitable for battery-powered and wearable-electronics applications
      - Peripherals include capacitive touch sensors, Hall sensor, SD card interface, Ethernet, high-speed SPI, UART, I2S and I2C
      */
#ifdef CONFIG_IDF_TARGET_ESP32

//      AddLog(LOG_LEVEL_DEBUG_MORE, PSTR("HDW: ESP32 Model %d, Revision %d, Core %d"), chip_info.model, chip_revision, chip_info.cores);

      switch (pkg_version) {
        case 0:
          if (single_core) { return F("ESP32-S0WDQ6"); }     // Max 240MHz, Single core, QFN 6*6
          else if (rev3)   { return F("ESP32-D0WDQ6-V3"); }  // Max 240MHz, Dual core, QFN 6*6
          else {             return F("ESP32-D0WDQ6"); }     // Max 240MHz, Dual core, QFN 6*6
        case 1:
          if (single_core) { return F("ESP32-S0WD"); }       // Max 160MHz, Single core, QFN 5*5, ESP32-SOLO-1, ESP32-DevKitC
          else if (rev3)   { return F("ESP32-D0WD-V3"); }    // Max 240MHz, Dual core, QFN 5*5, ESP32-WROOM-32E, ESP32_WROVER-E, ESP32-DevKitC
          else {             return F("ESP32-D0WD"); }       // Max 240MHz, Dual core, QFN 5*5, ESP32-WROOM-32D, ESP32_WROVER-B, ESP32-DevKitC
        case 2:              return F("ESP32-D2WD");         // Max 160MHz, Dual core, QFN 5*5, 2MB embedded flash
        case 3:
          if (single_core) { return F("ESP32-S0WD-OEM"); }   // Max 160MHz, Single core, QFN 5*5, Xiaomi Yeelight
          else {             return F("ESP32-D0WD-OEM"); }   // Max 240MHz, Dual core, QFN 5*5
        case 4:
          if (single_core) { return F("ESP32-U4WDH-S"); }    // Max 160MHz, Single core, QFN 5*5, 4MB embedded flash, ESP32-MINI-1, ESP32-DevKitM-1
          else {             return F("ESP32-U4WDH-D"); }    // Max 240MHz, Dual core, QFN 5*5, 4MB embedded flash
        case 5:
          if (rev3)        { return F("ESP32-PICO-V3"); }    // Max 240MHz, Dual core, LGA 7*7, ESP32-PICO-V3-ZERO, ESP32-PICO-V3-ZERO-DevKit
          else {             return F("ESP32-PICO-D4"); }    // Max 240MHz, Dual core, LGA 7*7, 4MB embedded flash, ESP32-PICO-KIT
        case 6:              return F("ESP32-PICO-V3-02");   // Max 240MHz, Dual core, LGA 7*7, 8MB embedded flash, 2MB embedded PSRAM, ESP32-PICO-MINI-02, ESP32-PICO-DevKitM-2
        case 7:              return F("ESP32-D0WDR2-V3");    // Max 240MHz, Dual core, QFN 5*5, ESP32-WROOM-32E, ESP32_WROVER-E, ESP32-DevKitC
      }
#endif  // CONFIG_IDF_TARGET_ESP32
      return F("ESP32");
    }
    case 2: {  // ESP32-S2
      /*
      ESP32-S2 Series
      - 32-bit MCU & 2.4 GHz Wi-Fi
      - High-performance 240 MHz single-core CPU
      - Ultra-low-power performance: fine-grained clock gating, dynamic voltage and frequency scaling
      - Security features: eFuse、flash encryption, secure boot, signature verification, integrated AES, SHA and RSA algorithms
      - Peripherals include 43 GPIOs, 1 full-speed USB OTG interface, SPI, I2S, UART, I2C, LED PWM, LCD interface, camera interface, ADC, DAC, touch sensor, temperature sensor
      - Availability of common cloud connectivity agents and common product features shortens the time to market
      */
#ifdef CONFIG_IDF_TARGET_ESP32S2
      uint32_t psram_ver = REG_GET_FIELD(EFUSE_RD_MAC_SPI_SYS_3_REG, EFUSE_PSRAM_VERSION);
      pkg_version += ((psram_ver & 0xF) * 100);

