arendst/Tasmota/tasmota/tasmota_support/support_esp32.ino
//      AddLog(LOG_LEVEL_DEBUG_MORE, PSTR("HDW: ESP32 Model %d, Revision %d, Core %d, Package %d"), chip_info.model, chip_revision, chip_info.cores, chip_ver);

      switch (pkg_version) {
        case 0:              return F("ESP32-S2");           // Max 240MHz, Single core, QFN 7*7, ESP32-S2-WROOM, ESP32-S2-WROVER, ESP32-S2-Saola-1, ESP32-S2-Kaluga-1
        case 1:              return F("ESP32-S2FH2");        // Max 240MHz, Single core, QFN 7*7, 2MB embedded flash, ESP32-S2-MINI-1, ESP32-S2-DevKitM-1
        case 2:              return F("ESP32-S2FH4");        // Max 240MHz, Single core, QFN 7*7, 4MB embedded flash
        case 3:              return F("ESP32-S2FN4R2");      // Max 240MHz, Single core, QFN 7*7, 4MB embedded flash, 2MB embedded PSRAM, , ESP32-S2-MINI-1U, ESP32-S2-DevKitM-1U
        case 100:            return F("ESP32-S2R2");
        case 102:            return F("ESP32-S2FNR2");       // Max 240MHz, Single core, QFN 7*7, 4MB embedded flash, 2MB embedded PSRAM, , Lolin S2 mini
      }
#endif  // CONFIG_IDF_TARGET_ESP32S2
      return F("ESP32-S2");
    }
    case 5: {  // ESP32-C3 = ESP8685 if embedded flash
      /*
      ESP32-C3 Series
      - 32-bit RISC-V MCU & 2.4 GHz Wi-Fi & Bluetooth 5 (LE)
      - 32-bit RISC-V single-core processor with a four-stage pipeline that operates at up to 160 MHz
      - State-of-the-art power and RF performance
      - 400 KB of SRAM and 384 KB of ROM on the chip, and SPI, Dual SPI, Quad SPI, and QPI interfaces that allow connection to flash
      - Reliable security features ensured by RSA-3072-based secure boot, AES-128-XTS-based flash encryption, the innovative digital signature and the HMAC peripheral, hardware acceleration support for cryptographic algorithms
      - Rich set of peripheral interfaces and GPIOs, ideal for various scenarios and complex applications
      */
#ifdef CONFIG_IDF_TARGET_ESP32C3
      switch (pkg_version) {
        case 0:              return F("ESP32-C3");           // Max 160MHz, Single core, QFN 5*5, ESP32-C3-WROOM-02, ESP32-C3-DevKitC-02
//        case 1:              return F("ESP32-C3FH4");        // Max 160MHz, Single core, QFN 5*5, 4MB embedded flash, ESP32-C3-MINI-1, ESP32-C3-DevKitM-1
        case 1:              return F("ESP8685");            // Max 160MHz, Single core, QFN 5*5, 4MB embedded flash, ESP32-C3-MINI-1, ESP32-C3-DevKitM-1
        case 2:              return F("ESP32-C3 AZ");        // QFN32
        case 3:              return F("ESP8686");            // QFN24
      }
#endif  // CONFIG_IDF_TARGET_ESP32C3
      return F("ESP32-C3");
    }
    case 4:     // ESP32-S3(beta2)
    case 6:     // ESP32-S3(beta3)
    case 9:  {  // ESP32-S3
      /*
      ESP32-S3 Series
      - 32-bit MCU & 2.4 GHz Wi-Fi & Bluetooth 5 (LE)
      - Xtensa® 32-bit LX7 dual-core processor that operates at up to 240 MHz
      - 512 KB of SRAM and 384 KB of ROM on the chip, and SPI, Dual SPI, Quad SPI, Octal SPI, QPI, and OPI interfaces that allow connection to flash and external RAM
      - Additional support for vector instructions in the MCU, which provides acceleration for neural network computing and signal processing workloads
      - Peripherals include 45 programmable GPIOs, SPI, I2S, I2C, PWM, RMT, ADC and UART, SD/MMC host and TWAITM
      - Reliable security features ensured by RSA-based secure boot, AES-XTS-based flash encryption, the innovative digital signature and the HMAC peripheral, “World Controller”
      */
#ifdef CONFIG_IDF_TARGET_ESP32S3
      switch (pkg_version) {
        case 0:              return F("ESP32-S3");           // QFN56
        case 1:              return F("ESP32-S3-PICO-1");    // LGA56
      }
#endif  // CONFIG_IDF_TARGET_ESP32S3
      return F("ESP32-S3");                                  // Max 240MHz, Dual core, QFN 7*7, ESP32-S3-WROOM-1, ESP32-S3-DevKitC-1
    }
    case 12: {  // ESP32-C2 = ESP8684 if embedded flash
      /*
      ESP32-C2 Series
      - 32-bit RISC-V MCU & 2.4 GHz Wi-Fi & Bluetooth 5 (LE)
      - 32-bit RISC-V single-core processor that operates at up to 120 MHz
      - State-of-the-art power and RF performance
      - 576 KB ROM, 272 KB SRAM (16 KB for cache) on the chip
      - 14 programmable GPIOs: SPI, UART, I2C, LED PWM controller, General DMA controller (GDMA), SAR ADC, Temperature sensor
      */
#ifdef CONFIG_IDF_TARGET_ESP32C2
      switch (pkg_version) {
        case 0:              return F("ESP32-C2");
        case 1:              return F("ESP32-C2");
      }
#endif  // CONFIG_IDF_TARGET_ESP32C2
      return F("ESP32-C2");
    }
    case 23: {  // ESP32-C5
      /*
      ESP32-C5 Series
      - Ultra-low-power SoC with 32-bit RISC-V single-core microprocessor
      - 2.4 and 5 GHz dual-band Wi-Fi 6 (802.11ax), Bluetooth® 5 (LE), Zigbee and Thread (802.15.4)
      - 27 or 19 GPIOs, rich set of peripherals
      */
#ifdef CONFIG_IDF_TARGET_ESP32C5
      switch (pkg_version) {
        case 0:              return F("ESP32-C5");
        case 1:              return F("ESP32-C5FH4");
      }
#endif  // CONFIG_IDF_TARGET_ESP32C5
      return F("ESP32-C5");
    }
    case 7:     // ESP32-C6(beta)
    case 13: {  // ESP32-C6
      /*
      ESP32-C6 Series
      - 32-bit RISC-V MCU & 2.4 GHz Wi-Fi 6 & Bluetooth 5 (LE) & IEEE 802.15.4
      - 32-bit RISC-V single-core processor that operates at up to 160 MHz
      - State-of-the-art power and RF performance
      - 320 KB ROM, 512 KB SRAM, 16 KB Low-power SRAM on the chip, and works with external flash
      - 30 (QFN40) or 22 (QFN32) programmable GPIOs, with support for SPI, UART, I2C, I2S, RMT, TWAI and PWM
      */
#ifdef CONFIG_IDF_TARGET_ESP32C6
      switch (pkg_version) {
        case 0:              return F("ESP32-C6");
        case 1:              return F("ESP32-C6FH4");
      }
#endif  // CONFIG_IDF_TARGET_ESP32C6
      return F("ESP32-C6");
    }
    case 10:    // ESP32-H2(beta1)
    case 14:    // ESP32-H2(beta2)
    case 16: {  // ESP32-H2
#ifdef CONFIG_IDF_TARGET_ESP32H2
      switch (pkg_version) {
        case 0:              return F("ESP32-H2");
      }
#endif  // CONFIG_IDF_TARGET_ESP32H2
      return F("ESP32-H2");
    }
    case 18: {  // ESP32-P4
      return F("ESP32-P4");
    }
  }
  return F("ESP32");
}

String GetDeviceHardwareRevision(void) {
  // ESP32-S2
  // ESP32-D0WDQ6 v1.0
  // ESP32-C3 v0.3
  // ESP32-C6FH4 v0.0
  String result = GetDeviceHardware();   // ESP32-C3

  esp_chip_info_t chip_info;
  esp_chip_info(&chip_info);
  uint32_t chip_revision = chip_info.revision;       // 16-bit chip revision number (in format MXX; where M - wafer major version, XX - wafer minor version)
  char revision[16];
  snprintf_P(revision, sizeof(revision), PSTR(" v%d.%d"), chip_revision / 100, chip_revision % 100);
  result += revision;                  // ESP32-C3 v0.3

  return result;
}

String GetCodeCores(void) {
#if defined(CORE32SOLO1)
  return F("single-core");
#else
  return F("");
#endif
}

uint32_t ESP_getChipCores(void) {
  return ESP.getChipCores();
}

uint32_t ESP_getChipRevision(void) {
  return ESP.getChipRevision();
}

String ESP_getEfuseMac(void) {
  return String(ESP.getEfuseMac());
}

String WifiGetPhyMode(void) {
  char stemp[10];
  return String(GetTextIndexed(stemp, sizeof(stemp), WiFiHelper::getPhyMode(), kWifiPhyMode));
}

/*********************************************************************************************\
 * High entropy hardware random generator
 * Thanks to DigitalAlchemist
\*********************************************************************************************/

#include <esp_random.h>

// Based on code from https://raw.githubusercontent.com/espressif/esp-idf/master/components/esp32/hw_random.c
uint32_t HwRandom(void) {
  // See for more info on the HW RNG:
  // https://docs.espressif.com/projects/esp-idf/en/latest/esp32s2/api-reference/system/random.html
  return esp_random();
}

